{
  "Jacoby Transfer": {
    "name": "Jacoby Transfer",
    "background": "Jacoby Transfers are a fundamental convention in response to 1NT openings. Named after Oswald Jacoby, this convention allows responder to transfer the contract to opener's hand, making the stronger hand declarer and protecting opening honors from the opening lead.",
    "when_used": "Use Jacoby Transfers when partner opens 1NT (15-17 HCP) and you have a 5+ card major suit. The transfer applies regardless of your point count - you can transfer with 0 HCP or 15+ HCP.",
    "how_it_works": "After partner's 1NT opening:\n• Bid 2♦ to transfer to hearts (showing 5+ hearts)\n• Bid 2♥ to transfer to spades (showing 5+ spades)\n\nPartner must accept the transfer by bidding your major suit at the 2-level.",
    "responder_actions": "After transferring:\n• With 0-7 HCP: Pass (invitational)\n• With 8-9 HCP: Invite game by bidding 2NT or raising to 3 of the major\n• With 10+ HCP and 5-card major: Bid 3NT or 4 of the major\n• With 10+ HCP and 6+ card major: Jump to 4 of the major\n• With slam interest: Bid a new suit to show a second suit and slam values",
    "opener_actions": "As opener:\n• Accept the transfer by bidding the requested major at the 2-level\n• With 4-card support and maximum (17 HCP): Consider jumping to 3 of the major (super-accept)\n• After accepting, respect responder's subsequent bids (pass, invite, or force to game)"
  },
  "Stayman": {
    "name": "Stayman Convention",
    "background": "Stayman is one of the most fundamental conventions in bridge, invented by Samuel Stayman. It allows responder to check for a 4-4 major suit fit after partner opens 1NT. Finding an 8-card major fit often produces better results than playing in notrump.",
    "when_used": "Use Stayman when partner opens 1NT (15-17 HCP) and you have:\n• At least one 4-card major (hearts or spades)\n• At least 8 HCP (or 7 HCP with both 4-card majors)\n• Interest in finding a major suit fit rather than playing in notrump",
    "how_it_works": "After partner's 1NT opening, bid 2♣ to ask about 4-card majors.\n\nOpener responds:\n• 2♦ = No 4-card major\n• 2♥ = 4+ hearts (may also have 4 spades)\n• 2♠ = 4+ spades (denies 4 hearts)",
    "responder_actions": "After opener's response:\n• If fit found (8+ cards in a major): Raise to game with 10+ HCP, invite with 8-9 HCP, or pass with minimum\n• If no fit (2♦ response): Bid 2NT (invitational, 8-9 HCP), 3NT (10+ HCP), or 2 of a 5-card major\n• With game-forcing values and no fit: Explore other contracts (3NT, minor suits, or slam)",
    "opener_actions": "As opener:\n• Respond truthfully about your 4-card majors\n• If you have both majors, bid 2♥ first\n• After your response, listen to partner's next bid to determine final contract\n• With maximum values (17 HCP), consider accepting invitations"
  },
  "Opener Rebid": {
    "name": "Opener's Rebid",
    "background": "After making an opening bid and hearing partner's response, opener's second bid (rebid) is crucial for describing hand strength and shape. The rebid helps partnership reach the correct level and strain.",
    "when_used": "After you open the bidding and partner responds, you must make a rebid to further describe your hand. This applies to all opening bids (1-level suit openings, 1NT, strong 2♣, weak 2-bids, etc.).",
    "how_it_works": "Rebids are categorized by strength:\n• Minimum rebid (13-15 HCP): Rebid your suit, raise partner, bid 1NT, or bid a new suit at the 1-level\n• Invitational rebid (16-18 HCP): Jump raise partner, jump in your suit, or bid 2NT\n• Game-forcing rebid (19+ HCP): Jump shift in a new suit or jump to game",
    "responder_actions": "As responder, after opener's rebid:\n• With minimum (6-9 HCP): Pass or bid game if opener showed invitational/game-forcing values\n• With invitational (10-12 HCP): Make an invitational bid if opener showed minimum\n• With game-forcing (13+ HCP): Continue bidding to game or explore slam",
    "opener_actions": "Choose your rebid based on:\n1. Your HCP range (minimum, invitational, or game-forcing)\n2. Your distribution (balanced, single-suited, two-suited)\n3. Partner's response (what they've shown)\n4. Whether you have support for partner's suit\n\nExamples:\n• 1♠ - 2♠ - 4♠ (15-17 HCP, 6+ spades)\n• 1♠ - 1NT - 2♠ (13-15 HCP, 6+ spades)\n• 1♠ - 2♥ - 3♥ (16-18 HCP, 4-card heart support)"
  },
  "Preemptive Bid": {
    "name": "Preemptive (Weak Two) Bids",
    "background": "Preemptive bids are deliberately high bids made with weaker hands to disrupt opponents' bidding. Weak Two bids (2♦, 2♥, 2♠) are the most common preempts, showing a 6-card suit with limited strength. The goal is to consume bidding space and make it difficult for opponents to find their best contract.",
    "when_used": "Open with a Weak Two (2♦/2♥/2♠) when you have:\n• 6-10 HCP (typically 6-8 in first or second seat)\n• A good 6-card suit (at least two of the top three honors)\n• Weak outside strength (no 4-card major on the side, no void)\n• Not vulnerable or favorable vulnerability",
    "how_it_works": "The 2-level preempt shows:\n• 6-card suit quality: QJxxxx or better\n• Limited strength: Can't open 1 of a suit\n• Offensive potential: Suit can produce tricks if it becomes trump\n• Defensive weakness: Few tricks if opponents play the contract",
    "responder_actions": "As responder to partner's preempt:\n• With 15+ HCP and fit: Raise to game\n• With 10-14 HCP and fit: Raise one level (invitational)\n• With 16+ HCP and no fit: Bid 2NT (asking for feature) or bid game\n• With weak hand: Usually pass\n• With strong hand and own suit: Bid new suit (forcing)",
    "opener_actions": "As preemptor:\n• Make your preempt and typically pass thereafter\n• Only bid again if forced by partner or if partner makes a forcing bid\n• Don't preempt with a hand that could open at the 1-level\n• In third seat (after two passes), you can preempt lighter\n• Remember: Preempt once and pass - don't bid your values twice"
  },
  "Blackwood": {
    "name": "Blackwood Convention",
    "background": "Blackwood (4NT) is the most famous ace-asking convention in bridge, invented by Easley Blackwood. It allows partnerships to check for aces (and kings) before bidding slam. Having sufficient aces is crucial to avoid losing the first two tricks in a slam contract.",
    "when_used": "Use Blackwood (bid 4NT) when:\n• You and partner have agreed on a trump suit (explicit or implicit)\n• You have slam interest (partnership has 33+ combined points)\n• You want to know how many aces partner holds\n• You're NOT using 4NT as a quantitative invite (which happens without a trump fit)",
    "how_it_works": "After bidding 4NT, partner responds:\n• 5♣ = 0 or 4 aces\n• 5♦ = 1 ace\n• 5♥ = 2 aces\n• 5♠ = 3 aces\n\nIf all aces are present, 5NT asks for kings (same step responses).",
    "responder_actions": "As responder to Blackwood:\n• Count your aces and respond according to the schedule\n• Don't count honors or high cards - only aces\n• After showing aces, if partner bids 5NT (king ask), respond similarly for kings\n• If partner signs off (bids 5 or 6 of the trump suit), pass or correct to the agreed trump",
    "opener_actions": "As the Blackwood asker:\n• Only ask for aces when you can handle any response\n• After hearing the ace count, decide: Sign off in 5/6 of trump, ask for kings (5NT), or bid grand slam (7)\n• If missing 2 aces: Sign off at the 5-level\n• If missing 1 ace: Bid small slam (6-level)\n• If holding all aces: Can ask for kings or bid small slam\n• If holding all aces and kings: Consider grand slam (7-level)"
  },
  "Takeout Double": {
    "name": "Takeout Double",
    "background": "A takeout double is a conventional double that asks partner to bid their best suit. Unlike a penalty double (which says 'I want to defend'), a takeout double says 'I have opening values and support for the unbid suits - please bid your best suit.' This is one of the most important competitive bidding tools.",
    "when_used": "Make a takeout double when opponents open and you have:\n• 12+ HCP (opening strength or better)\n• Support for all unbid suits (typically 3+ cards in each)\n• Shortness in opponent's suit (ideally singleton or void)\n• At the 1-level: 12-15 HCP; at the 2-level: 15+ HCP",
    "how_it_works": "After RHO (right-hand opponent) opens 1♥:\n• Double = Takeout (asking partner to bid spades, diamonds, or clubs)\n• Partner must bid unless RHO bids (then partner can pass)\n• The double promises support for unbid suits and opening values",
    "responder_actions": "As advancer (partner of doubler):\n• You MUST bid unless RHO bids (then you can pass)\n• Bid your longest unbid suit, even with 0 HCP\n• With 0-8 HCP: Bid at minimum level\n• With 9-11 HCP: Jump one level (invitational)\n• With 12+ HCP: Jump to game or cuebid opponent's suit (game-forcing)\n• With length in opponent's suit and scattered values: Pass to convert to penalty",
    "opener_actions": "As takeout doubler:\n• After partner responds, bid according to your strength:\n  - Minimum (12-15 HCP): Pass or raise partner modestly\n  - Medium (16-18 HCP): Jump raise partner or bid game\n  - Strong (19+ HCP): Force to game\n• With a strong hand, you can cuebid or jump to show extra values\n• Remember: You promised support for unbid suits, so raise partner with 4-card support"
  },
  "Negative Double": {
    "name": "Negative Double",
    "background": "A negative double is a responsive double made by responder after partner opens and RHO overcalls. It allows responder to show values and compete for the contract when they can't make a natural bid. The name 'negative' distinguishes it from 'penalty' doubles, though modern usage is purely conventional.",
    "when_used": "Make a negative double when:\n• Partner opens 1 of a suit\n• RHO (right-hand opponent) overcalls\n• You have 6+ HCP and can't make a natural bid\n• You have length in unbid suits (especially unbid majors)\n• You want to compete but don't have a good natural bid",
    "how_it_works": "After 1♦ - (1♠) - Dbl:\n• The double shows hearts (the unbid major) and some values\n• Opener must bid, typically in the suit(s) responder is showing\n• The level of the double indicates strength: through 2♠ = 6+ HCP, higher = 10+ HCP",
    "responder_actions": "As doubler:\n• At low levels (1-level overcall): 6+ HCP, 4+ cards in unbid major(s)\n• At higher levels (2-level overcall): 8-10+ HCP, length in unbid suits\n• After doubling, respect opener's rebid\n• With game-forcing values (13+ HCP), plan your rebid to show strength\n• Typical pattern: 4-4 or 5-4 in unbid suits",
    "opener_actions": "As opener after partner's negative double:\n• Bid your best unbid suit at the cheapest level with minimum (13-15 HCP)\n• Jump with extras (16-18 HCP)\n• Bid notrump with stopper in opponent's suit and balanced hand\n• Raise partner's implied suit with 4-card support\n• Cuebid opponent's suit with strong hand and no clear direction\n• Example: 1♦ - (1♠) - Dbl - (P) - 2♥ shows 4 hearts and minimum opening"
  },
  "Michaels Cuebid": {
    "name": "Michaels Cuebid",
    "background": "Michaels Cuebid is an immediate overcall in opponent's suit showing a two-suited hand with at least 5-5 in two specific suits. It's a powerful tool for describing distribution quickly and disrupting opponent's bidding. Named after Mike Michaels who popularized it.",
    "when_used": "Use Michaels Cuebid when opponent opens and you have:\n• 5-5 or better distribution in two suits\n• 8-16 HCP (typically - can be lighter at favorable vulnerability)\n• After minor opening (1♣/1♦): Shows both majors\n• After major opening (1♥/1♠): Shows other major + unspecified minor",
    "how_it_works": "Cuebid opponent's suit to show:\n• 1♣ - 2♣ = Both majors (5+ hearts and 5+ spades)\n• 1♦ - 2♦ = Both majors\n• 1♥ - 2♥ = Spades + minor (5+ spades and 5+ clubs or diamonds)\n• 1♠ - 2♠ = Hearts + minor\n\nPartner bids their best fit or asks for the minor with 2NT.",
    "responder_actions": "As advancer (partner of Michaels bidder):\n• With fit for known major: Bid it at appropriate level based on your values\n• Without fit but need to find the minor: Bid 2NT (asking 'which minor?')\n• With weak hand: Pick your better major at minimum level\n• With strong hand (12+ HCP): Jump to game or cuebid\n• Competitive principle: Bid to the level equal to your combined trump count",
    "opener_actions": "As Michaels bidder:\n• After showing your two-suiter, usually pass unless partner invites or forces\n• If partner bids 2NT (asking for minor): Bid your minor\n• With maximum (15-16 HCP): Accept game tries\n• With minimum (8-11 HCP): Pass partner's minimum choice\n• Don't bid again unless forced - you've described your hand\n• Remember: Length matters more than points for this convention"
  },
  "Unusual 2NT": {
    "name": "Unusual 2NT",
    "background": "Unusual 2NT is a conventional overcall showing a two-suited hand with both minor suits (clubs and diamonds). It's the minor-suit counterpart to Michaels Cuebid and serves to disrupt opponent's bidding while showing a specific hand type.",
    "when_used": "Use Unusual 2NT when opponent opens and you have:\n• 5-5 or better in both minors (clubs and diamonds)\n• 8-16 HCP (typically - can be lighter at favorable vulnerability)\n• Limited defensive strength\n• Usually after opponent opens a major (1♥ or 1♠)\n• Can also be used after 1♣ or 1♦ opening",
    "how_it_works": "After opponent's opening bid:\n• 1♥ - 2NT = 5+ clubs and 5+ diamonds\n• 1♠ - 2NT = 5+ clubs and 5+ diamonds\n\nPartner picks their better minor or bids with game values.",
    "responder_actions": "As advancer (partner of 2NT bidder):\n• With preference: Bid your better minor at minimum level (weak hand)\n• With equal length: Bid clubs (lower ranking) to stay lower\n• With 10+ HCP: Jump in your better minor (invitational)\n• With 12+ HCP and fit: Consider bidding game in the minor (5♣/5♦)\n• With very strong hand: Cuebid opponent's suit to explore slam\n• Typical response: Pick your 3+ card minor, even with weak hand",
    "opener_actions": "As Unusual 2NT bidder:\n• After showing both minors, typically pass unless forced\n• Accept game invitations with maximum (15-16 HCP) and good suits\n• Pass minimum choices - you've fully described your hand\n• Don't rebid unless partner makes forcing bid\n• With very strong hand (17+ HCP), plan to bid again over minimum response\n• Remember: Focus on distribution and preemptive value, not just HCP"
  },
  "Splinter Bid": {
    "name": "Splinter Bid",
    "background": "A splinter bid is a jump bid in a new suit showing game-forcing values, 4+ card support for partner's suit, and a singleton or void in the bid suit. It's an invaluable tool for slam exploration, as it identifies hands with excellent 'fitting' values where honors are in working suits rather than wasted opposite partner's shortness.",
    "when_used": "Use a splinter bid when:\n• Partner opens 1 of a major\n• You have 12+ HCP and game-forcing values\n• You have 4+ card support for partner's major\n• You have a singleton or void in a side suit\n• You want to explore slam possibilities",
    "how_it_works": "After partner opens 1♠:\n• 4♣ = Splinter (game-forcing, 4+ spades, singleton/void clubs)\n• 4♦ = Splinter (game-forcing, 4+ spades, singleton/void diamonds)\n• 4♥ = Splinter (game-forcing, 4+ spades, singleton/void hearts)\n\nThe unusual jump (skipping a level) identifies it as a splinter, not natural.",
    "responder_actions": "As responder using splinters:\n• Jump to 4 of your singleton suit (double jump) after partner's 1-level major opening\n• Show your singleton/void to help partner evaluate\n• After splintering, cooperate with partner's slam tries or sign off in game\n• With 15+ HCP: Can cuebid after splintering to show extras\n• Don't splinter with minimum opening values - need game-forcing strength",
    "opener_actions": "As opener after partner's splinter:\n• Evaluate your hand:\n  - Wasted honors in splinter suit = discouraging (e.g., KQ in their singleton suit)\n  - Working honors in other suits = encouraging\n  - Controls (aces/kings) in side suits = encouraging\n• With wasted values: Sign off in game (4 of the major)\n• With working values: Explore slam via cuebids or RKC Blackwood\n• Example: 1♠ - 4♦ (splinter) - If you hold ♦KQ, sign off; if you hold ♦x, explore slam"
  },
  "Fourth Suit Forcing": {
    "name": "Fourth Suit Forcing (FSF)",
    "background": "Fourth Suit Forcing is a conventional bid where responder bids the only unbid suit (the 'fourth suit') artificially to force opener to bid again. It creates a game-forcing auction and asks opener to further describe their hand. This is essential when responder has values but no clear natural bid.",
    "when_used": "Use Fourth Suit Forcing when:\n• Three suits have been bid naturally\n• You (responder) have game-forcing values (12+ HCP) but no clear bid\n• You need more information from opener\n• You don't have support for partner's suits\n• You don't have a stopper for notrump\n• You need to create a forcing auction",
    "how_it_works": "After the auction 1♦ - 1♥ - 1♠:\n• 2♣ = Fourth Suit Forcing (artificial, game-forcing, asking opener to describe further)\n• This is NOT showing clubs naturally\n• Opener must bid again, typically showing:\n  - 3-card heart support\n  - Club stopper for notrump\n  - Extra length in a previously bid suit\n  - Minimum/maximum strength",
    "responder_actions": "As responder using FSF:\n• Bid the fourth suit when you need more info and have game-forcing values\n• After opener's rebid, place the final contract based on new information\n• Typical FSF hands: 12+ HCP, 5-card suit, no fit yet, no stopper for 3NT\n• After opener's response:\n  - If opener shows 3-card support: Raise to game in your major\n  - If opener shows stopper: Bid 3NT\n  - If opener rebids their suit: Choose between 3NT or supporting their suit",
    "opener_actions": "As opener after partner's FSF:\n• First priority: Show 3-card support for responder's major\n• Second priority: Show stopper in fourth suit for notrump\n• Third priority: Rebid your suit with 6+ cards\n• Fourth priority: Raise fourth suit with 4+ cards (rare, showing misfit)\n• Show extras if you have them (jump with 17+ HCP)\n• Example: 1♦ - 1♥ - 1♠ - 2♣ (FSF) - 2♥ = 3-card heart support, typically minimum"
  }
}
